Ran Plan for dir: `terraform/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_instance.myec2vm[1] will be created
+ resource "aws_instance" "myec2vm" {
      + ami                                  = "ami-05548f9cecf47b442"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "terraform-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "Atlantis_Eval_Count_1"
        }
      + tags_all                             = {
          + "Name" = "Atlantis_Eval_Count_1"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "d27a7be0897045fdd3ca533a5b86bb758987e79f"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-08aa489306a95159a",
          + "sg-09b89cc96a522cf62",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
~ for_output_list                 = [
        "ec2-52-90-45-196.compute-1.amazonaws.com",
      + (known after apply),
    ]
~ for_output_map1                 = {
      - i-0499efd17778c31dc = "ec2-52-90-45-196.compute-1.amazonaws.com"
    } -> (known after apply)
~ for_output_map2                 = {
      + "1" = (known after apply)
        # (1 unchanged attribute hidden)
    }
~ latest_splat_instance_publicdns = [
        "ec2-52-90-45-196.compute-1.amazonaws.com",
      + (known after apply),
    ]
~ legacy_splat_instance_publicdns = [
        "ec2-52-90-45-196.compute-1.amazonaws.com",
      + (known after apply),
    ]
Releasing state lock. This may take a few moments...
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](https://c5c1-2601-282-167f-db10-35b9-e3b1-28cf-fda4.ngrok-free.app/lock?id=pseudonative%252FATLANTIS%252Fterraform%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/dev`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`